<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 应用 Key
    |--------------------------------------------------------------------------
    |
    | LeanCloud 应用控制台 -> 设置 -> 应用 Key
    |
    */

    'app_id' => env('LEANCLOUD_APP_ID', null),

    'app_key' => env('LEANCLOUD_APP_KEY', null),

    'master_key' => env('LEANCLOUD_MASTER_KEY', null),

    /*
    |--------------------------------------------------------------------------
    | Api Server
    |--------------------------------------------------------------------------
    |
    | 例子：https://xxxxxxxx.api.lncld.net
    | xxxxxxxx 一般为 App ID 前八位
    |
    */
    'api_server' => env('LEANCLOUD_API_SERVER', null),

    /*
    |--------------------------------------------------------------------------
    | 云引擎环境
    |--------------------------------------------------------------------------
    */
    'env' => env('LEANCLOUD_APP_ENV', 'production'),
];
